[Killed] Regex
main/components/HelpRequest/HelpRequestForm.js:27:26
 
     // Stryker disable next-line all
     const email_regex = /[A-Za-z0-9]+@[A-Za-z]{4,}/i; // Accepts at least 1 letter or number, followed by one '@', followed by at least 4 letters.
-    const teamid_regex = /[a-z][0-9]{2}-[0-9](p|a)m-[1-4]/i; //Matches a team id
+    const teamid_regex = /[a-z][0-9]-[0-9](p|a)m-[1-4]/i; //Matches a team id
 
     return (
killedBy: HelpRequestForm tests No Error messsages on good input
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

<html>
  <head />
  <body>

[Killed] EqualityOperator
main/components/HelpRequest/HelpRequestForm.js:70:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.requesterEmail && 'Requester Email is required.'}
-                            {errors.requesterEmail?.type === 'pattern' && 'Requester email must be a valid email.'}
+                            {errors.requesterEmail?.type !== 'pattern' && 'Requester email must be a valid email.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests No Error messsages on good input
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <div class="invalid-feedback">Requester email must be a valid email.</div> instead

[Killed] OptionalChaining
main/components/HelpRequest/HelpRequestForm.js:70:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.requesterEmail && 'Requester Email is required.'}
-                            {errors.requesterEmail?.type === 'pattern' && 'Requester email must be a valid email.'}
+                            {errors.requesterEmail.type === 'pattern' && 'Requester email must be a valid email.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:91:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.teamId && 'Team ID is required.'}
+                            {false}
                             {errors.teamId?.type === 'pattern' && 'Team ID must be a valid team id.'}
                         </Form.Control.Feedback>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Team ID is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:91:30
                             })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.teamId && 'Team ID is required.'}
+                            {true}
                             {errors.teamId?.type === 'pattern' && 'Team ID must be a valid team id.'}
                         </Form.Control.Feedback>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Team ID is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:92:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.teamId && 'Team ID is required.'}
-                            {errors.teamId?.type === 'pattern' && 'Team ID must be a valid team id.'}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Team ID must be a valid team id./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.js:92:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.teamId && 'Team ID is required.'}
-                            {errors.teamId?.type === 'pattern' && 'Team ID must be a valid team id.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Team ID must be a valid team id./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.js:108:43
                             type="text"
                             isInvalid={Boolean(errors.tableOrBreakoutRoom)}
                             {...register("tableOrBreakoutRoom", {
-                                required: "Table Or Breakout Room is required."
+                                required: ""
                             })}
                         />
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Table Or Breakout Room is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.js:127:57
                             id="requestTime"
                             type="datetime-local"
                             isInvalid={Boolean(errors.requestTime)}
-                            {...register("requestTime", {
-                                required: true,
-                                pattern: isodate_regex
-                            })}
+                            {...register("requestTime", {})}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Request Time is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
