[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:59:30
                             {...register("requesterEmail", { required: true, pattern: email_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requesterEmail && 'Requester Email is required. '}
+                            {true}
                             {errors.requesterEmail?.type === 'pattern' && 'Requester Email must be a valid email.'}
                         </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Requester Email is required. /. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:59:30
                             {...register("requesterEmail", { required: true, pattern: email_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.requesterEmail && 'Requester Email is required. '}
+                            {false}
                             {errors.requesterEmail?.type === 'pattern' && 'Requester Email must be a valid email.'}
                         </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Requester Email is required. /. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.js:60:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.requesterEmail && 'Requester Email is required. '}
-                            {errors.requesterEmail?.type === 'pattern' && 'Requester Email must be a valid email.'}
+                            {errors.requesterEmail.type === 'pattern' && 'Requester Email must be a valid email.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] EqualityOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:60:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.requesterEmail && 'Requester Email is required. '}
-                            {errors.requesterEmail?.type === 'pattern' && 'Requester Email must be a valid email.'}
+                            {errors.requesterEmail?.type !== 'pattern' && 'Requester Email must be a valid email.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Requester Email/

Here are the matching elements:

<label
  class="form-label"
  for="requesterEmail"
>

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.js:74:42
                             id="professorEmail"
                             type="text"
                             isInvalid={Boolean(errors.professorEmail)}
-                            {...register("professorEmail", { required: true, pattern: email_regex })}
+                            {...register("", { required: true, pattern: email_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:77:30
                             {...register("professorEmail", { required: true, pattern: email_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.professorEmail && 'Professor Email is required. '}
+                            {false}
                             {errors.professorEmail?.type === 'pattern' && 'Professor Email must be a valid email.'}
                         </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Professor Email is required. /. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:77:30
                             {...register("professorEmail", { required: true, pattern: email_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.professorEmail && 'Professor Email is required. '}
+                            {errors.professorEmail || 'Professor Email is required. '}
                             {errors.professorEmail?.type === 'pattern' && 'Professor Email must be a valid email.'}
                         </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Professor Email/

Here are the matching elements:

<label
  class="form-label"
  for="professorEmail"
>

[Killed] EqualityOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:78:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.professorEmail && 'Professor Email is required. '}
-                            {errors.professorEmail?.type === 'pattern' && 'Professor Email must be a valid email.'}
+                            {errors.professorEmail?.type !== 'pattern' && 'Professor Email must be a valid email.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Professor Email/

Here are the matching elements:

<label
  class="form-label"
  for="professorEmail"
>

[Killed] OptionalChaining
main/components/RecommendationRequest/RecommendationRequestForm.js:78:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.professorEmail && 'Professor Email is required. '}
-                            {errors.professorEmail?.type === 'pattern' && 'Professor Email must be a valid email.'}
+                            {errors.professorEmail.type === 'pattern' && 'Professor Email must be a valid email.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.js:114:30
                             {...register("dateRequested", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateRequested && 'Date Requested is required.'}
+                            {errors.dateRequested || 'Date Requested is required.'}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Date Requested/

Here are the matching elements:

<label
  class="form-label"
  for="dateRequested"
>

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.js:131:30
                             {...register("dateNeeded", { required: true, pattern: isodate_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.dateNeeded && 'Date Needed is required.'}
+                            {true}
                         </Form.Control.Feedback>
                     </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Needed is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <form
      class=""
    >
      <div
